docs/performance/raw/20260926-a029-338/single/k6-warmup.txt


  █ TOTAL RESULTS 

    checks_total.......: 10      0.55232/s
    checks_succeeded...: 100.00% 10 out of 10
    checks_failed......: 0.00%   0 out of 10

    ✓ user login 200

    HTTP
    http_req_duration..............: avg=40.09ms min=5.55ms med=36.3ms max=255.49ms p(90)=90.75ms p(95)=99.05ms
      { expected_response:true }...: avg=40.09ms min=5.55ms med=36.3ms max=255.49ms p(90)=90.75ms p(95)=99.05ms
    http_req_failed................: 0.00%  0 out of 308
    http_reqs......................: 308    17.011459/s

    EXECUTION
    iteration_duration.............: avg=1.07s   min=1.03s  med=1.05s  max=1.31s    p(90)=1.1s    p(95)=1.24s  
    iterations.....................: 144    7.953409/s
    vus............................: 4      min=0        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 126 kB 6.9 kB/s
    data_sent......................: 153 kB 8.4 kB/s